blog4/app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
---
  <strong>
    <%= User.find_by("id":comment.user_id).username %>