blog4/app/views/comments/edit.html.erb

SELECT "blogs".* FROM "blogs" WHERE (id) LIMIT ?  [["LIMIT", 1]]
---
 <%= button_to "Destroy this comment", @comment, method: :delete %> |
  <%= link_to "Back blog", Blog.find_by("id",@comment.blog_id) %>