cookbook3/app/controllers/commands_controller.rb

SELECT "commands".* FROM "commands"
---
  def index
    @commands = Command.all