cookbook3/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "created_at", "updated_at", "category_id", "instructions", "commands") VALUES (?, ?, ?, ?, ?, ?)  [["title", "eee"], ["created_at", "2022-10-30 04:34:59.444861"], ["updated_at", "2022-10-30 04:34:59.444861"], ["category_id", 3], ["instructions", nil], ["commands", nil]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "updated_at" = ?, "instructions" = ? WHERE "recipes"."id" = ?  [["updated_at", "2022-10-30 04:39:35.389704"], ["instructions", "333"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)