cookbook3/app/views/commands/_form.html.erb

SELECT "recipes".* FROM "recipes"
---

  <div><%= form.collection_select(:recipe_id, Recipe.all, :id, :title) %></div>