cookbook3/app/views/categories/show.html.erb

    <b>Recipes of this category:</b>
    <%= (@category.recipes.collect { |recipe| recipe.title }).join(", ") %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."category_id" = ?  [["category_id", 2]]