cookbook3/app/views/recipes/_form.html.erb

  </div>
<div><%= form.collection_select(:category_id, Category.all, :id, :name) %></div>
---
SELECT "categories".* FROM "categories"