blog4/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["title", "333"], ["content", "333"], ["created_at", "2022-12-31 02:27:59.364125"], ["updated_at", "2022-12-31 02:27:59.364125"]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user=current_user

    respond_to do |format|
      if @blog.save