blog4/app/controllers/comments_controller.rb

  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params)
    @comment.blog = @blog
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "blog_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["blog_id", 1], ["content", "iii"], ["created_at", "2022-12-29 12:17:53.061075"], ["updated_at", "2022-12-29 12:17:53.061075"]]