blog4/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "user1"], ["password", "[FILTERED]"], ["created_at", "2022-12-29 10:03:05.166943"], ["updated_at", "2022-12-29 10:03:05.166943"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "[FILTERED]"], ["updated_at", "2022-12-30 03:28:14.488971"], ["id", 2]]